In [2]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis-kelamin kelas
0         1     Biologi     30     perempuan   12D
1         2      Fisika     84     perempuan   12D
2         3  Matematika     15     perempuan   12B
3         4       Kimia     35     laki-laki   12C
4         5     Biologi     12     laki-laki   12C

<h2>Quiz 1 : Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [40]:
# code here
df.loc[:,['nilai','kelas']]

    nilai kelas
0      33   12D
1      60   12C
2      51   12C
3       0   12A
4      20   12D
5      46   12C
6      22   12D
7      57   12C
8      91   12A
9       9   12D
10     55   12B
11     49   12A
12     46   12D
13     20   12B
14     93   12B
15      2   12B
16     67   12B
17     89   12C
18     33   12A
19     99   12C

In [7]:
df.iloc[5:11].loc[:,['pelajaran','nilai']]

     pelajaran  nilai
5       Fisika     72
6   Matematika     25
7      Biologi     57
8       Fisika     41
9      Geologi     52
10  Matematika     15

<h2>Quiz 2 : Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [42]:
# code here
df[(df['pelajaran'] == 'Ekonomi') | (df['pelajaran'] == 'Fisika')]

    siswa_id pelajaran  nilai jenis-kelamin kelas
0          1    Fisika     33     perempuan   12D
2          3   Ekonomi     51     perempuan   12C
3          4   Ekonomi      0     laki-laki   12A
6          7    Fisika     22     laki-laki   12D
14        15    Fisika     93     laki-laki   12B
19        20    Fisika     99     perempuan   12C

In [43]:
df[(df['pelajaran'] == 'Kimia') & (df['nilai'] > 50)]

    siswa_id pelajaran  nilai jenis-kelamin kelas
8          9     Kimia     91     perempuan   12A
17        18     Kimia     89     perempuan   12C

In [44]:
df[(df['nilai'] > 70) & (df['jenis-kelamin'] == 'perempuan') & (df['kelas'] == '12C')]

    siswa_id pelajaran  nilai jenis-kelamin kelas
17        18     Kimia     89     perempuan   12C
19        20    Fisika     99     perempuan   12C

<h2>Quiz 3 : Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![title](image/day2-1.png)
![title](image/day2-2.png)

In [18]:
# code here
df['nilai_normalized'] = df['nilai'].apply(lambda x : (x - df['nilai'].min()) / df['nilai'].max() - df['nilai'].min())
df.head()

,siswa_id,pelajaran,nilai,jenis-kelamin,kelas,nilai_sklearn,nilai_normalized
0,1,Biologi,30,perempuan,12D,0.3250,-3.690476
1,2,Fisika,84,perempuan,12D,1.0000,-3.047619
2,3,Matematika,15,perempuan,12B,0.1375,-3.869048
3,4,Kimia,35,laki-laki,12C,0.3875,-3.630952
4,5,Biologi,12,laki-laki,12C,0.1000,-3.904762